In [2]:
import pandas as pd

In [3]:
base_salarios = pd.read_csv('Salaries.csv')

A partir da base de dados Salaries, responder às questões abaixo:


Ex1- Quais colunas tem nesta base?


Ex2- Qual é a coluna de salario base?


Ex3- Qual é o salário médio?


Ex4- Qual é o salário máximo?


Ex5- Qual é o emprego do JOSEPH DRISCOLL?


Ex6- Qual o nome da pessoa que tem o maior salário de todos?


Ex7- Qual é o salário médio por ano?


Ex8- Quais são os cinco empregos mais comuns (JobTitle)?


Ex9- Existe correlação entre ano e salário?


Ex10- Como criar um outro dataframe selecionando apenas algumas colunas do dataframe original?

In [4]:
colunas = base_salarios.columns
print(colunas)

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [5]:
salario_base = base_salarios['BasePay']
display(salario_base)

0         167411.18
1         155966.02
2         212739.13
3          77916.00
4         134401.60
            ...
148649         0.00
148650          NaN
148651          NaN
148652          NaN
148653         0.00
Name: BasePay, Length: 148654, dtype: float64

In [6]:
salario_medio = base_salarios['BasePay'].mean()
print(salario_medio)

66325.4488404877

In [7]:
salario_maximo = base_salarios['BasePay'].max()
print(salario_maximo)

319275.01

In [12]:
person_name = 'JOSEPH DRISCOLL'
job_title_of_person = base_salarios.loc[base_salarios['EmployeeName'] == person_name, ['JobTitle']]
display(job_title_of_person)

                     JobTitle
24  CAPTAIN, FIRE SUPPRESSION

In [15]:
pessoa_maior_salario = base_salarios.loc[base_salarios['BasePay'] == salario_maximo, ['EmployeeName', 'BasePay']]
display(pessoa_maior_salario)

         EmployeeName    BasePay
72925  Gregory P Suhr  319275.01

In [17]:
salario_medio_ano = base_salarios[['Year', 'BasePay']].groupby('Year').mean()
display(salario_medio_ano)

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

In [22]:
display(base_salarios[['JobTitle', 'EmployeeName']].groupby(['JobTitle']).count())

                                                EmployeeName
JobTitle
ACCOUNT CLERK                                             83
ACCOUNTANT                                                 5
ACCOUNTANT INTERN                                         48
ACPO,JuvP, Juv Prob (SFERS)                                1
ACUPUNCTURIST                                              1
...                                                      ...
X-RAY LABORATORY AIDE                                     26
X-Ray Laboratory Aide                                    100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS             1
Youth Comm Advisor                                         4
ZOO CURATOR                                                1

[2159 rows x 1 columns]

In [34]:
freq_job_title = base_salarios['JobTitle'].value_counts()
display(freq_job_title)
print(type(freq_job_title))

Transit Operator                                  7036
Special Nurse                                     4389
Registered Nurse                                  3736
Public Svc Aide-Public Works                      2518
Police Officer 3                                  2421
                                                  ...
CHIEF HOUSING INSPECTOR                              1
TRAFFIC SIGNAL OPERATOR                              1
COURT COMPUTER FACILITIES COORDINATOR                1
AUTOMOTIVE BODY AND FENDER WORKER SUPERVISOR I       1
VICTIM & WITNESS TECHNICIAN                          1
Name: JobTitle, Length: 2159, dtype: int64

<class 'pandas.core.series.Series'>